# AssetSetIterator Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetSetIterator Constructor
AssetSetIterator Class See Also
---
Initializes a new instance of the AssetSetIterator class
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public AssetSetIterator()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
AssetSetIterator()
```

# See Also
AssetSetIterator Class
Autodesk.Revit.DB.Visual Namespace